Fix errors in diagrams
